goessl/ATmega328P/NRF24L01_Interrupt.c
    NRF24L01_setCSN(true);
    
    
    return status;
}


static uint8_t NRF24L01_write(uint8_t address, uint8_t* data, size_t len)
{
    return NRF24L01_command(NRF24L01_CMD_W_REGISTER(address), data, len);
}

static uint8_t NRF24L01_read(uint8_t address, uint8_t* data, size_t len)
{
    return NRF24L01_command(NRF24L01_CMD_R_REGISTER(address), data, len);
}

static uint8_t NRF24L01_writeByte(uint8_t address, uint8_t data)
{
    return NRF24L01_write(address, &data, 1);
}

static uint8_t NRF24L01_readByte(uint8_t address)
{
    uint8_t data;
    
    NRF24L01_read(address, &data, 1);
    
    return data;
}

static uint8_t NRF24L01_writeBits(uint8_t address, uint8_t start, uint8_t len,
    uint8_t data)
{
    uint8_t mask = (1 << len) - 1;
    uint8_t temp = NRF24L01_readByte(address);
    
    temp &= ~(mask << start);
    temp |= (data & mask) << start;
    
    return NRF24L01_writeByte(address, temp);
}

static uint8_t NRF24L01_readBits(uint8_t address, uint8_t start, uint8_t len)
{
    uint8_t mask = (1 << len) - 1;
    uint8_t data = NRF24L01_readByte(address);
    
    return (data >> start) & mask;
}

static uint8_t NRF24L01_writeBit(uint8_t address, size_t bit, bool value)
{
    uint8_t data = NRF24L01_readByte(address);
    
    if(value)
        data |= (1 << bit);
    else
        data &= ~(1 << bit);
    
    return NRF24L01_writeByte(address, data);
}

static bool NRF24L01_readBit(uint8_t address, size_t bit)
{
    uint8_t data = NRF24L01_readByte(address);
    
    return (data & (1 << bit))?true:false;
}


static void NRF24L01_readRXPayload(uint8_t* data, uint8_t len)
{
    NRF24L01_command(NRF24L01_CMD_R_RX_PAYLOAD, data, len);
}

static void NRF24L01_writeTXPayload(uint8_t* data, uint8_t len)
{
    NRF24L01_command(NRF24L01_CMD_W_TX_PAYLOAD, data, len);
}

static void NRF24L01_flushTX(void)
{
    NRF24L01_command(NRF24L01_CMD_FLUSH_TX, NULL, 0);
}

static void NRF24L01_flushRX(void)
{
    NRF24L01_command(NRF24L01_CMD_FLUSH_RX, NULL, 0);
}

static void NRF24L01_setReuseTXEnabled(void)
{
    NRF24L01_command(NRF24L01_CMD_REUSE_TX_PL, NULL, 0);
}

static uint8_t NRF24L01_getRXPayloadWidth(void)
{
    uint8_t data;
    
    NRF24L01_command(NRF24L01_CMD_R_RX_PL_WID, &data, 1);
    
    return data;
}

static void NRF24L01_writeAcknowledgePayload(uint8_t pipe,
    uint8_t* data, uint8_t len)
{
    NRF24L01_command(NRF24L01_CMD_W_ACK_PAYLOAD(pipe), data, len);
}

static void NRF24L01_lockUnlock(void)
{
    uint8_t data = NRF24L01_CMD_ACTIVATE_DATA;
    NRF24L01_command(NRF24L01_CMD_ACTIVATE, &data, 1);
}

static uint8_t NRF24L01_getStatus(void)
{
    return NRF24L01_command(NRF24L01_CMD_NOP, NULL, 0);
}


//Registers
//Config
static bool NRF24L01_getInterruptRXDREnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_MASK_RX_DR);
}

static void NRF24L01_setInterruptRXDREnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_MASK_RX_DR, enabled);
}

static bool NRF24L01_getInterruptTXDSEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_MASK_TX_DS);
}

static void NRF24L01_setInterruptTXDSEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_MASK_TX_DS, enabled);
}

static bool NRF24L01_getInterruptMAXRTEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_MASK_MAX_RT);
}

static void NRF24L01_setInterruptMAXRTEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_MASK_MAX_RT, enabled);
}

static bool NRF24L01_getCRCEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_EN_CRC);
}

static void NRF24L01_setCRCEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_EN_CRC, enabled);
}

static bool NRF24L01_getCRCBytes(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_CRCO);
}

static void NRF24L01_setCRCBytes(bool twoBytes)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_CRCO, twoBytes);
}

static bool NRF24L01_getPowerUpEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_PWR_UP);
}

static void NRF24L01_setPowerUpEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_PWR_UP, enabled);
}

static bool NRF24L01_getPrimRXEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_PRIM_RX);
}

static void NRF24L01_setPrimRXEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_CONFIG, NRF24L01_BIT_PRIM_RX, enabled);
}

//Enable auto acknowledge
static bool NRF24L01_getAutoAcknowledgeEnabled(uint8_t pipe)
{
    return NRF24L01_readBit(NRF24L01_RA_EN_AA, NRF24L01_BIT_ENAA_P(pipe));
}

static void NRF24L01_setAutoAcknowledgeEnabled(uint8_t pipe, bool enabled)
{
    if(pipe == NRF24L01_PIPES_N)
        NRF24L01_writeBits(NRF24L01_RA_EN_AA, NRF24L01_BIT_ENAA_P0,
            NRF24L01_PIPES_N, (enabled)?0xFF:0x00);
    else
        NRF24L01_writeBit(NRF24L01_RA_EN_AA, NRF24L01_BIT_ENAA_P(pipe),
            enabled);
}

//Enable RX pipe
static bool NRF24L01_getPipeEnabled(uint8_t pipe)
{
    return NRF24L01_readBit(NRF24L01_RA_EN_RXADDR, NRF24L01_BIT_ERX_P(pipe));
}

static void NRF24L01_setPipeEnabled(uint8_t pipe, bool enabled)
{
    if(pipe == NRF24L01_PIPES_N)
        NRF24L01_writeBits(NRF24L01_RA_EN_RXADDR, NRF24L01_BIT_ERX_P0,
            NRF24L01_PIPES_N, (enabled)?0xFF:0x00);
    else
        NRF24L01_writeBit(NRF24L01_RA_EN_RXADDR, NRF24L01_BIT_ERX_P(pipe),
            enabled);
}

//Address width
static uint8_t NRF24L01_getAddressWidth(void)
{
    uint8_t data = NRF24L01_readBits(NRF24L01_RA_SETUP_AW, NRF24L01_BIT_AW,
        NRF24L01_LEN_AW);
    
    if(data == 0x01)
        return 3;
    else if(data == 0x02)
        return 4;
    else
        return 5;
}

static void NRF24L01_setAddressWidth(uint8_t width)
{
    uint8_t data;
    
    if(width == 3)
        data = 0x01;
    else if(width == 4)
        data = 0x02;
    else
        data = 0x03;
    
    NRF24L01_writeBits(NRF24L01_RA_SETUP_AW, NRF24L01_BIT_AW, NRF24L01_LEN_AW,
        data);
}

//Retries
static uint16_t NRf24L01_getAutoRetransmitDelay(void)
{
    uint16_t data = NRF24L01_readBits(NRF24L01_RA_SETUP_RETR, NRF24L01_BIT_ARD,
        NRF24L01_LEN_ARD);
    
    return 250 * (data + 1);
}

static void NRF24L01_setAutoRetransmitDelay(uint16_t delay)
{
    uint8_t data = delay / 250 - 1;
    
    NRF24L01_writeBits(NRF24L01_RA_SETUP_RETR, NRF24L01_BIT_ARD,
        NRF24L01_LEN_ARD, data);
}

static uint8_t NRf24L01_getAutoRetransmitCount(void)
{
    return NRF24L01_readBits(NRF24L01_RA_SETUP_RETR, NRF24L01_BIT_ARC,
        NRF24L01_LEN_ARC);
}

static void NRF24L01_setAutoRetransmitCount(uint8_t retries)
{
    NRF24L01_writeBits(NRF24L01_RA_SETUP_RETR, NRF24L01_BIT_ARC,
        NRF24L01_LEN_ARC, retries);
}

