goessl/ATmega328P/NRF24L01_Interrupt.c
//RF channel
static uint8_t NRF24L01_getRFChannel(void)
{
    return NRF24L01_readBits(NRF24L01_RA_RF_CH, NRF24L01_BIT_RF_CH,
        NRF24L01_LEN_RF_CH);
}

static void NRF24L01_setRFChannel(uint8_t channel)
{
    NRF24L01_writeBits(NRF24L01_RA_RF_CH, NRF24L01_BIT_RF_CH,
        NRF24L01_LEN_RF_CH, channel);
}

//RF setup
static bool NRF24L01_getContinuousCarrierEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_CONT_WAVE);
}

static void NRF24L01_setContinuousCarrierEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_CONT_WAVE, enabled);
}

static bool NRF24L01_getDataRate250kbpsEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_RF_DR_LOW);
}

static void NRF24L01_setDataRate250kbpsEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_RF_DR_LOW, enabled);
}

static bool NRF24L01_getPLLLockEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_PLL_LOCK);
}

static void NRF24L01_setPLLLockEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_PLL_LOCK, enabled);
}

static bool NRF24L01_getHighDataRateEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_RF_DR_HIGH);
}

static void NRF24L01_setHighDataRateEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_RF_DR_HIGH, enabled);
}

static uint8_t NRF24L01_getOutputPower(void)
{
    return NRF24L01_readBits(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_RF_PWR,
        NRF24L01_LEN_RF_PWR);
}

static void NRF24L01_setOutputPower(uint8_t power)
{
    NRF24L01_writeBits(NRF24L01_RA_RF_SETUP, NRF24L01_BIT_RF_PWR,
        NRF24L01_LEN_RF_PWR, power);
}

//Status
static uint8_t NRF24L01_getInterrupts(void)
{
    return NRF24L01_getStatus()
        & ((1 << NRF24L01_BIT_RX_DR) | (1 << NRF24L01_BIT_TX_DS)
            | (1 << NRF24L01_BIT_MAX_RT));
}

static uint8_t NRF24L01_getClearInterrupts(void)
{
    uint8_t data = NRF24L01_getInterrupts();
    
    NRF24L01_writeByte(NRF24L01_RA_STATUS, data);
    
    return data;
}

static void NRF24L01_clearRXDRInterrupt(void)
{
    NRF24L01_writeBit(NRF24L01_RA_STATUS, NRF24L01_BIT_RX_DR, 1);
}

static void NRF24L01_clearTXDSInterrupt(void)
{
    NRF24L01_writeBit(NRF24L01_RA_STATUS, NRF24L01_BIT_TX_DS, 1);
}

static void NRF24L01_clearMAXRTInterrupt(void)
{
    NRF24L01_writeBit(NRF24L01_RA_STATUS, NRF24L01_BIT_MAX_RT, 1);
}

static uint8_t NRF24L01_getRXPipe(void)
{
    return NRF24L01_readBits(NRF24L01_RA_STATUS, NRF24L01_BIT_RX_P_NO,
        NRF24L01_LEN_RX_P_NO);
}

//Observe TX
static uint8_t NRF24L01_getLostPackets(void)
{
    return NRF24L01_readBits(NRF24L01_RA_OBSERVE_TX, NRF24L01_BIT_PLOS_CNT,
        NRF24L01_LEN_PLOS_CNT);
}

static uint8_t NRF24L01_getRetransmittedPackets(void)
{
    return NRF24L01_readBits(NRF24L01_RA_OBSERVE_TX, NRF24L01_BIT_ARC_CNT,
        NRF24L01_LEN_ARC_CNT);
}

//Received power detector
static bool NRF24L01_getCarrierDetected(void)
{
    return NRF24L01_readBit(NRF24L01_RA_RPD, NRF24L01_BIT_RPD);
}

//RX addresses
static void NRF24L01_getRXAddress(uint8_t pipe, uint8_t* address)
{
    NRF24L01_read(NRF24L01_RA_RX_ADDR_P(pipe), address,
        NRF24L01_RA_RX_ADDR_P_LEN(pipe));
}

static void NRF24L01_setRXAddress(uint8_t pipe, uint8_t* address)
{
   NRF24L01_write(NRF24L01_RA_RX_ADDR_P(pipe), address,
    NRF24L01_RA_RX_ADDR_P_LEN(pipe));
}

//TX address
static void NRF24L01_getTXAddress(uint8_t* address)
{
    NRF24L01_read(NRF24L01_RA_TX_ADDR, address, NRF24L01_RA_TX_ADDR_LEN);
}

static void NRF24L01_setTXAddress(uint8_t* address)
{
    NRF24L01_write(NRF24L01_RA_TX_ADDR, address, NRF24L01_RA_TX_ADDR_LEN);
}

//RX payload widths
static uint8_t NRF24L01_getPayloadWidth(uint8_t pipe)
{
    return NRF24L01_readBits(NRF24L01_RA_RX_PW_P(pipe), NRF24L01_BIT_RX_PW_P,
        NRF24L01_LEN_RX_PW_P);
}

static void NRF24L01_setPayloadWidth(uint8_t pipe, uint8_t width)
{
    NRF24L01_writeBits(NRF24L01_RA_RX_PW_P(pipe), NRF24L01_BIT_RX_PW_P,
        NRF24L01_LEN_RX_PW_P, width);
}

//FIFO status
static bool NRF24L01_getReuseTXEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FIFO_STATUS, NRF24L01_BIT_TX_REUSE);
}

static bool NRF24L01_getTXFIFOFull(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FIFO_STATUS, NRF24L01_BIT_FIFO_TX_FULL);
}

static bool NRF24L01_getTXFIFOEmpty(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FIFO_STATUS, NRF24L01_BIT_TX_EMPTY);
}

static bool NRF24L01_getRXFIFOFull(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FIFO_STATUS, NRF24L01_BIT_RX_FULL);
}

static bool NRF24L01_getRXFIFOEmpty(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FIFO_STATUS, NRF24L01_BIT_RX_EMPTY);
}

//Dynamic payload
static bool NRF24L01_getDynamicPayloadPipeEnabled(uint8_t pipe)
{
    return NRF24L01_readBit(NRF24L01_RA_DYNPD, NRF24L01_BIT_DPL_P(pipe));
}

static void NRF24L01_setDynamicPayloadPipeEnabled(uint8_t pipe, bool enabled)
{
    if(pipe == NRF24L01_PIPES_N)
        NRF24L01_writeBits(NRF24L01_RA_DYNPD, NRF24L01_BIT_DPL_P0,
            NRF24L01_PIPES_N, (enabled)?0xFF:0x00);
    else
        NRF24L01_writeBit(NRF24L01_RA_DYNPD, NRF24L01_BIT_DPL_P(pipe), enabled);
}

//Features
static bool NRF24L01_getDynamicPayloadEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FEATURE, NRF24L01_BIT_EN_DPL);
}

static void NRF24L01_setDynamicPayloadEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_FEATURE, NRF24L01_BIT_EN_DPL, enabled);
}

static bool NRF24L01_getAcknowledgePayloadEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FEATURE, NRF24L01_BIT_EN_ACK_PAY);
}

static void NRF24L01_setAcknowledgePayloadEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_FEATURE, NRF24L01_BIT_EN_ACK_PAY, enabled);
}

static bool NRF24L01_getDynamicAcknowledgeEnabled(void)
{
    return NRF24L01_readBit(NRF24L01_RA_FEATURE, NRF24L01_BIT_EN_DYN_ACK);
}

void NRF24L01_setDynamicAcknowledgeEnabled(bool enabled)
{
    NRF24L01_writeBit(NRF24L01_RA_FEATURE, NRF24L01_BIT_EN_DYN_ACK, enabled);
}



void NRF24L01_init(uint8_t* csnDDR, uint8_t* csnPORT, uint8_t csnPin,
    uint8_t* ceDDR, uint8_t* cePORT, uint8_t cePin)
{
    NRF24L01_csnPORT = csnPORT;
    NRF24L01_csnPin = csnPin;
    NRF24L01_cePORT = cePORT;
    NRF24L01_cePin = cePin;
    
    *csnDDR |= (1 << NRF24L01_csnPin);
    *ceDDR |= (1 << NRF24L01_cePin);
    NRF24L01_setCSN(true);
    NRF24L01_setCE(false);
    
    
    #if NRF24L01_INTERRUPT == 0
        EIMSK |= (1 << INT0);
    #elif NRF24L01_INTERRUPT == 1
        EIMSK |= (1 << INT1);
    #endif
    
    
