goessl/ATmega328P/NRF24L01_Interrupt.c
    //10Mhz, Msb first, Mode 0
    //SPI_init(10000000, 0, 0, 0);
    
    
    
    _delay_ms(100);
    
    //Close all pipes
    NRF24L01_setPipeEnabled(NRF24L01_PIPES_N, false);
    NRF24L01_setAutoAcknowledgeEnabled(NRF24L01_PIPES_N, false);
    
    
    //Open pipe 0
    NRF24L01_setPipeEnabled(0, true);
    NRF24L01_setPayloadWidth(0, NRF24L01_MAX_PAYLOAD);
    NRF24L01_setAutoAcknowledgeEnabled(0, true);
    NRF24L01_setDynamicPayloadPipeEnabled(0, true);
    //CRC 2 bytes
    NRF24L01_setCRCBytes(true);
    //Auto retransmit
    NRF24L01_setAutoRetransmitDelay(500);
    NRF24L01_setAutoRetransmitCount(15);
    //ACK payload, dynamic payload width
    NRF24L01_setAcknowledgePayloadEnabled(true);
    if(NRF24L01_readByte(NRF24L01_RA_FEATURE) == 0x00
        && NRF24L01_readByte((NRF24L01_RA_DYNPD) == 0x00))
    {
        NRF24L01_lockUnlock();
        NRF24L01_setAcknowledgePayloadEnabled(true);
    }
    NRF24L01_setDynamicPayloadEnabled(true);
    NRF24L01_setDynamicPayloadPipeEnabled(NRF24L01_PIPES_N, true);
    //Enable RX
    NRF24L01_setPrimRXEnabled(true);
    
    //Power up
    NRF24L01_setPowerUpEnabled(true);
    _delay_us(150);
    
    
    
    //Listen
    NRF24L01_setCE(true);
}



void NRF24L01_sendData(uint8_t* data, uint8_t len)
{
    NRF24L01_setCE(false);
    
    NRF24L01_flushTX();
    
    NRF24L01_writeTXPayload(data, len);
    NRF24L01_setPrimRXEnabled(false);
    
    NRF24L01_setCE(true);
    _delay_us(10);
    NRF24L01_setCE(false);
    
    NRF24L01_txStatus = NRF24L01_TX_STATUS_BUSY;
}

uint8_t NRF24L01_getTXStatus(void)
{
    return NRF24L01_txStatus;
}

void NRF24L01_setAcknowledgePayload(uint8_t* data, uint8_t len)
{
    NRF24L01_writeAcknowledgePayload(0, data, len);
}


bool NRF24L01_dataAvailable(void)
{
    return NRF24L01_rxLen > 0;
}

uint8_t NRF24L01_getData(uint8_t* data)
{
    uint8_t temp = NRF24L01_rxLen;
    
    memcpy(data, (uint8_t*)NRF24L01_rxData, NRF24L01_rxLen);
    NRF24L01_rxLen = 0;
    
    return temp;
}



ISR(NRF24L01_vect)
{
    switch(NRF24L01_getClearInterrupts())
    {
        //Data received
        case (1 << NRF24L01_BIT_RX_DR):
            while(!NRF24L01_getRXFIFOEmpty())
            {
                if(NRF24L01_getRXPipe() < NRF24L01_PIPES_N)
                {
                    NRF24L01_rxLen = NRF24L01_getRXPayloadWidth();
                    NRF24L01_readRXPayload((uint8_t*)NRF24L01_rxData,
                        NRF24L01_rxLen);
                }
            }
            break;
        
        //Data sent
        case (1 << NRF24L01_BIT_TX_DS):
            NRF24L01_txStatus = NRF24L01_TX_STATUS_TX_DS;
            NRF24L01_setPrimRXEnabled(true);
            NRF24L01_setCE(true);
            break;
        
        //Data sent & acknowledge payload received
        case ((1 << NRF24L01_BIT_RX_DR) | (1 << NRF24L01_BIT_TX_DS)):
            while(!NRF24L01_getRXFIFOEmpty())
            {
                if(NRF24L01_getRXPipe() < NRF24L01_PIPES_N)
                {
                    NRF24L01_rxLen = NRF24L01_getRXPayloadWidth();
                    NRF24L01_readRXPayload((uint8_t*)NRF24L01_rxData,
                        NRF24L01_rxLen);
                }
            }
            NRF24L01_txStatus = NRF24L01_TX_STATUS_TX_AP;
            NRF24L01_setPrimRXEnabled(true);
            NRF24L01_setCE(true);
            break;
        
        //Max retries reached
        case (1 << NRF24L01_BIT_MAX_RT):
            NRF24L01_flushTX();
            NRF24L01_txStatus = NRF24L01_TX_STATUS_MAX_RT;
            NRF24L01_setPrimRXEnabled(true);
            NRF24L01_setCE(true);
            break;
        
        
        default:
            break;
    }
}
